Repository: MGanesh517/Gauva-Rider
Catalog: lib/l10n/intl_*.arb
Languages: ar, bn, de, es, ru, zh

source: Estimated Time
ar: الوقت المقدر
bn: আনুমানিক সময়
de: Geschätzte Zeit
es: Tiempo estimado
ru: Примерное время
zh: 预计时间

# ride_complete
source: Your Ride is Complete
ar: اكتملت رحلتك
bn: আপনার রাইড সম্পন্ন হয়েছে
de: Ihre Fahrt ist abgeschlossen
es: Tu viaje ha terminado
ru: Поездка завершена
zh: 您的行程已完成

# ride_feedback_prompt
source: We hope you had a smooth ride. Please complete your payment and rate your experience.
ar: نأمل أن تكون رحلتك مريحة. يرجى إتمام الدفع وتقييم تجربتك.
bn: আশা করি রাইডটি মসৃণ হয়েছে। অনুগ্রহ করে পেমেন্ট সম্পন্ন করুন এবং রেটিং দিন।
de: Wir hoffen, dass Ihre Fahrt reibungslos war. Bitte bezahlen Sie und bewerten Sie Ihre Erfahrung.
es: Esperamos que hayas tenido un buen viaje. Por favor, completa el pago y califica tu experiencia.
ru: Надеемся, поездка прошла гладко. Пожалуйста, оплатите и оцените поездку.
zh: 希望您有愉快的旅程，请完成付款并评分。

source: Confirm Pay
ar: تأكيد الدفع
bn: পেমেন্ট নিশ্চিত করুন
de: Bezahlung bestätigen
es: Confirmar pago
ru: Подтвердить оплату
zh: 确认付款

source: Select payment method
ar: اختر طريقة الدفع
bn: পেমেন্ট পদ্ধতি নির্বাচন করুন
de: Zahlungsmethode auswählen
es: Seleccionar método de pago
ru: Выберите способ оплаты
zh: 选择支付方式

# payment_completed
source: Thank You! Payment Completed
ar: شكرًا لك! تم الدفع
bn: ধন্যবাদ! পেমেন্ট সম্পন্ন হয়েছে
de: Vielen Dank! Zahlung abgeschlossen
es: ¡Gracias! Pago completado
ru: Спасибо! Оплата завершена
zh: 谢谢！付款完成

# payment_confirmation
source: paid via {method}. We hope you had a great ride! Don't forget to leave a rating.
ar: تم الدفع عبر {method}. نأمل أن تكون رحلتك رائعة! لا تنسَ ترك تقييم.
bn: {method} মাধ্যমে পেমেন্ট হয়েছে। আশা করি রাইডটি ভালো হয়েছে! দয়া করে রেটিং দিতে ভুলবেন না।
de: bezahlt mit {method}. Wir hoffen, Sie hatten eine tolle Fahrt! Bitte vergessen Sie nicht zu bewerten.
es: pagado con {method}. ¡Esperamos que hayas tenido un gran viaje! No olvides dejar una calificación.
ru: оплачено через {method}. Надеемся, поездка вам понравилась! Не забудьте оставить отзыв.
zh: 通过 {method} 支付。希望您旅途愉快！别忘了留下评分。

# share_experience
source: Share Your Experience!
ar: شارك تجربتك!
bn: আপনার অভিজ্ঞতা শেয়ার করুন!
de: Teilen Sie Ihre Erfahrung!
es: ¡Comparte tu experiencia!
ru: Поделитесь своим опытом!
zh: 分享您的体验！

# enter_experience
source: Enter your Experience!
ar: أدخل تجربتك!
bn: আপনার অভিজ্ঞতা লিখুন!
de: Geben Sie Ihre Erfahrung ein!
es: ¡Escribe tu experiencia!
ru: Опишите ваш опыт!
zh: 输入您的体验！

source: Submit
ar: إرسال
bn: জমা দিন
de: Absenden
es: Enviar
ru: Отправить
zh: 提交

source: Service Charge
ar: رسوم الخدمة
bn: পরিষেবা চার্জ
de: Servicegebühr
es: Cargo por servicio
ru: Плата за обслуживание
zh: 服务费

source: Discount
ar: خصم
bn: ডিসকাউন্ট
de: Rabatt
es: Descuento
ru: Скидка
zh: 折扣

source: Total Amount
ar: المبلغ الإجمالي
bn: মোট পরিমাণ
de: Gesamtbetrag
es: Importe total
ru: Общая сумма
zh: 总金额

source: Please Select Payment Type
ar: يرجى اختيار نوع الدفع
bn: অনুগ্রহ করে পেমেন্ট টাইপ নির্বাচন করুন
de: Bitte wählen Sie eine Zahlungsart
es: Por favor selecciona un tipo de pago
ru: Пожалуйста, выберите способ оплаты
zh: 请选择支付类型

# drag_map_adjust_location
source: Drag The Map to Adjust The Location
ar: اسحب الخريطة لتعديل الموقع
bn: অবস্থান সমন্বয়ের জন্য মানচিত্র টেনে আনুন
de: Karte ziehen, um den Standort anzupassen
es: Arrastra el mapa para ajustar la ubicación
ru: Перетащите карту, чтобы отрегулировать местоположение
zh: 拖动地图以调整位置

source: Confirm Destination
ar: تأكيد الوجهة
bn: গন্তব্য নিশ্চিত করুন
de: Ziel bestätigen
es: Confirmar destino
ru: Подтвердить пункт назначения
zh: 确认目的地

source: Confirm Pick-up
ar: تأكيد نقطة الالتقاط
bn: পিকআপ নিশ্চিত করুন
de: Abholung bestätigen
es: Confirmar recogida
ru: Подтвердить посадку
zh: 确认上车点

source: No address found
ar: لم يتم العثور على عنوان
bn: কোন ঠিকানা পাওয়া যায়নি
de: Keine Adresse gefunden
es: No se encontró dirección
ru: Адрес не найден
zh: 未找到地址

source: Full Name
ar: الاسم الكامل
bn: পুরো নাম
de: Vollständiger Name
es: Nombre completo
ru: Полное имя
zh: 全名

source: Mobile Number
ar: رقم الجوال
bn: মোবাইল নম্বর
de: Handynummer
es: Número de móvil
ru: Номер телефона
zh: 手机号码

source: Email
ar: البريد الإلكتروني
bn: ইমেইল
es: Correo electrónico
ru: Электронная почта
zh: 电子邮件

source: Gender
ar: الجنس
bn: লিঙ্গ
de: Geschlecht
es: Género
ru: Пол
zh: 性别

# gender_required
source: Gender is required
ar: الجنس مطلوب
bn: লিঙ্গ প্রয়োজন
de: Geschlecht ist erforderlich
es: El género es obligatorio
ru: Пол обязателен
zh: 性别为必填项

source: Save
ar: حفظ
bn: সংরক্ষণ করুন
de: Speichern
es: Guardar
ru: Сохранить
zh: 保存

source: Current Password
ar: كلمة المرور الحالية
bn: বর্তমান পাসওয়ার্ড
de: Aktuelles Passwort
es: Contraseña actual
ru: Текущий пароль
zh: 当前密码

source: New Password
ar: كلمة المرور الجديدة
bn: নতুন পাসওয়ার্ড
de: Neues Passwort
es: Nueva contraseña
ru: Новый пароль
zh: 新密码

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة
bn: নতুন পাসওয়ার্ড নিশ্চিত করুন
de: Neues Passwort bestätigen
es: Confirmar nueva contraseña
ru: Подтвердите новый пароль
zh: 确认新密码

# all_rights_reserved
source: {msg} All rights reserved.
ar: {msg} جميع الحقوق محفوظة.
bn: {msg} সর্বস্বত্ব সংরক্ষিত।
de: {msg} Alle Rechte vorbehalten.
es: {msg} Todos los derechos reservados.
ru: {msg} Все права защищены.
zh: {msg} 版权所有。

source: CLOSE
ar: إغلاق
bn: বন্ধ করুন
de: SCHLIESSEN
es: CERRAR
ru: ЗАКРЫТЬ
zh: 关闭

# delete_account_confirmation
source: Are you sure you want to delete your account?
ar: هل أنت متأكد أنك تريد حذف حسابك؟
bn: আপনি কি নিশ্চিত যে আপনার অ্যাকাউন্ট মুছে ফেলতে চান?
de: Sind Sie sicher, dass Sie Ihr Konto löschen möchten?
es: ¿Está seguro de que desea eliminar su cuenta?
ru: Вы уверены, что хотите удалить свою учетную запись?
zh: 您确定要删除您的账户吗？

# delete_account_warning
source: This action is permanent and cannot be undone.
ar: هذا الإجراء دائم ولا يمكن التراجع عنه.
bn: এই কাজটি স্থায়ী এবং পূর্বাবস্থায় ফেরানো যাবে না।
de: Diese Aktion ist dauerhaft und kann nicht rückgängig gemacht werden.
es: Esta acción es permanente y no se puede deshacer.
ru: Это действие является окончательным и не может быть отменено.
zh: 此操作是永久性的，无法撤销。

source: Delete
ar: حذف
bn: মুছে ফেলুন
de: Löschen
es: Eliminar
ru: Удалить
zh: 删除

source: Login with your Password
ar: تسجيل الدخول باستخدام كلمة المرور الخاصة بك
bn: আপনার পাসওয়ার্ড দিয়ে লগইন করুন
de: Mit Ihrem Passwort anmelden
es: Iniciar sesión con su contraseña
ru: Войдите с помощью пароля
zh: 使用您的密码登录

source: Use your password here
ar: استخدم كلمة المرور الخاصة بك هنا
bn: এখানে আপনার পাসওয়ার্ড ব্যবহার করুন
de: Verwenden Sie hier Ihr Passwort
es: Use su contraseña aquí
ru: Используйте свой пароль здесь
zh: 在此使用您的密码

source: Use OTP Instead
ar: استخدم رمز التحقق بدلاً من ذلك
bn: তার পরিবর্তে ওটিপি ব্যবহার করুন
de: Verwenden Sie stattdessen OTP
es: Usar OTP en su lugar
ru: Используйте OTP вместо этого
zh: 改用一次性密码（OTP）

source: Either phone number is null or password is empty
ar: رقم الهاتف فارغ أو كلمة المرور فارغة
bn: ফোন নম্বর খালি বা পাসওয়ার্ড ফাঁকা
de: Telefonnummer ist leer oder Passwort ist leer
es: Número de teléfono vacío o contraseña vacía
ru: Номер телефона пустой или пароль пустой
zh: 电话号码为空或密码为空

source: Add Balance to Your Wallet
ar: أضف رصيدًا إلى محفظتك
bn: আপনার ওয়ালেটে ব্যালেন্স যোগ করুন
de: Guthaben zu Ihrer Wallet hinzufügen
es: Agrega saldo a tu billetera
ru: Добавьте баланс в ваш кошелек
zh: 向您的钱包充值

source: Top up your wallet securely and enjoy seamless payments.
ar: قم بشحن محفظتك بأمان واستمتع بالدفع السلس.
bn: নিরাপদে আপনার ওয়ালেট পূরণ করুন এবং নির্বিঘ্নে পেমেন্ট উপভোগ করুন।
de: Laden Sie Ihre Wallet sicher auf und genießen Sie nahtlose Zahlungen.
es: Recarga tu billetera de forma segura y disfruta de pagos sin interrupciones.
ru: Пополните кошелек безопасно и наслаждайтесь беспроблемными платежами.
zh: 安全地为您的钱包充值，享受无缝支付体验。

source: No Payment methods available
ar: لا توجد طرق دفع متاحة
bn: কোন পেমেন্ট পদ্ধতি পাওয়া যায়নি
de: Keine Zahlungsmethoden verfügbar
es: No hay métodos de pago disponibles
ru: Нет доступных способов оплаты
zh: 无可用的支付方式

source: Select Card type
ar: اختر نوع البطاقة
bn: কার্ডের ধরন নির্বাচন করুন
de: Kartentyp auswählen
es: Selecciona tipo de tarjeta
ru: Выберите тип карты
zh: 选择卡类型

source: Enter Amount
ar: أدخل المبلغ
bn: পরিমাণ লিখুন
de: Betrag eingeben
es: Ingrese monto
ru: Введите сумму
zh: 输入金额

source: Enter a valid amount
ar: أدخل مبلغًا صالحًا
bn: একটি সঠিক পরিমাণ লিখুন
de: Geben Sie einen gültigen Betrag ein
es: Ingrese un monto válido
ru: Введите допустимую сумму
zh: 输入有效金额

source: Add Wallet
ar: أضف إلى المحفظة
bn: ওয়ালেট যোগ করুন
de: Wallet hinzufügen
es: Agregar a la billetera
ru: Добавить кошелек
zh: 添加钱包

source: Form is not valid
ar: النموذج غير صالح
bn: ফর্মটি বৈধ নয়
de: Formular ist ungültig
es: El formulario no es válido
ru: Форма недействительна
zh: 表单无效

source: Add Payment Gateway
ar: إضافة بوابة دفع
bn: পেমেন্ট গেটওয়ে যোগ করুন
de: Zahlungsgateway hinzufügen
es: Agregar pasarela de pago
ru: Добавить платежный шлюз
zh: 添加支付网关

source: Cardholder Name
ar: اسم صاحب البطاقة
bn: কার্ডধারীর নাম
de: Name des Karteninhabers
es: Nombre del titular de la tarjeta
ru: Имя держателя карты
zh: 持卡人姓名

# enter_cardholder_name
source: Enter name
ar: أدخل اسم صاحب البطاقة
bn: নাম লিখুন
de: Name des Karteninhabers eingeben
es: Ingrese el nombre del titular de la tarjeta
ru: Введите имя держателя карты
zh: 输入持卡人姓名

# card_number
source: Card no
ar: رقم البطاقة
bn: কার্ড নম্বর
de: Kartennummer
es: Número de tarjeta
ru: Номер карты
zh: 卡号

source: Enter valid card number
ar: أدخل رقم بطاقة صالح
bn: সঠিক কার্ড নম্বর লিখুন
de: Gültige Kartennummer eingeben
es: Ingrese un número de tarjeta válido
ru: Введите действительный номер карты
zh: 输入有效的卡号

source: Exp. Date
ar: تاريخ الانتهاء
bn: মেয়াদ শেষের তারিখ
de: Ablaufdatum
es: Fecha de expiración
ru: Срок действия
zh: 到期日期

source: Pick a date
ar: اختر تاريخًا
bn: একটি তারিখ নির্বাচন করুন
de: Datum auswählen
es: Elija una fecha
ru: Выберите дату
zh: 选择日期

source: CVV
ar: رمز CVV

source: Enter 3-digit CVV
ar: أدخل رمز CVV المكون من 3 أرقام
bn: ৩ সংখ্যার CVV লিখুন
de: 3-stellige CVV eingeben
es: Ingrese el CVV de 3 dígitos
ru: Введите 3-значный CVV
zh: 输入3位数CVV

source: Country
ar: الدولة
bn: দেশ
de: Land
es: País
ru: Страна
zh: 国家

source: Select a country
ar: اختر دولة
bn: একটি দেশ নির্বাচন করুন
de: Land auswählen
es: Seleccione un país
ru: Выберите страну
zh: 选择一个国家

source: Connection timeout with API server
ar: انتهت مهلة الاتصال بخادم API
bn: API সার্ভারের সাথে সংযোগের সময় শেষ হয়েছে
de: Zeitüberschreitung bei der Verbindung mit dem API-Server
es: Tiempo de conexión agotado con el servidor API
ru: Превышено время ожидания соединения с API-сервером
zh: 与 API 服务器连接超时

source: Receive timeout with API server
ar: انتهت مهلة الاستلام من خادم API
bn: API সার্ভার থেকে ডেটা গ্রহণের সময় শেষ হয়েছে
de: Zeitüberschreitung beim Empfang vom API-Server
es: Tiempo de espera agotado al recibir datos del servidor API
ru: Превышено время ожидания получения от API-сервера
zh: 从 API 服务器接收超时

source: Send timeout with API server
ar: انتهت مهلة الإرسال إلى خادم API
bn: API সার্ভারে ডেটা পাঠানোর সময় শেষ হয়েছে
de: Zeitüberschreitung beim Senden an den API-Server
es: Tiempo de espera agotado al enviar datos al servidor API
ru: Превышено время ожидания отправки на API-сервер
zh: 向 API 服务器发送超时

source: Bad certificate with API server
ar: شهادة غير صالحة مع خادم API
bn: API সার্ভারের সাথে খারাপ সার্টিফিকেট
de: Ungültiges Zertifikat beim API-Server
es: Certificado inválido con el servidor API
ru: Неверный сертификат с API-сервером
zh: API 服务器证书错误

# received_invalid_response_from_server
source: Received an invalid response from the server.
ar: تم استلام استجابة غير صالحة من الخادم.
bn: সার্ভার থেকে অবৈধ উত্তর পাওয়া গেছে।
de: Ungültige Antwort vom Server erhalten.
es: Se recibió una respuesta inválida del servidor.
ru: Получен неверный ответ от сервера.
zh: 从服务器接收到无效响应。

source: Request to API server was cancelled
ar: تم إلغاء الطلب إلى خادم API
bn: API সার্ভারে অনুরোধ বাতিল হয়েছে
de: Anfrage an API-Server wurde abgebrochen
es: Solicitud al servidor API fue cancelada
ru: Запрос к API-серверу был отменён
zh: 请求已被取消

source: Connection error with API server
ar: خطأ في الاتصال بخادم API
bn: API সার্ভারের সাথে সংযোগ ত্রুটি
de: Verbindungsfehler mit dem API-Server
es: Error de conexión con el servidor API
ru: Ошибка соединения с API-сервером
zh: 与 API 服务器连接错误

# no_internet_connection_please_check
source: No internet connection. Please check your internet connection.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من اتصالك بالإنترنت.
bn: ইন্টারনেট সংযোগ নেই। অনুগ্রহ করে আপনার ইন্টারনেট সংযোগ পরীক্ষা করুন।
de: Keine Internetverbindung. Bitte überprüfen Sie Ihre Internetverbindung.
es: Sin conexión a Internet. Por favor verifica tu conexión.
ru: Отсутствует интернет-соединение. Пожалуйста, проверьте подключение.
zh: 无网络连接。请检查您的网络。

# unexpected_error_occurred
source: An unexpected error occurred
ar: حدث خطأ غير متوقع
bn: একটি অপ্রত্যাশিত ত্রুটি ঘটেছে
de: Ein unerwarteter Fehler ist aufgetreten
es: Ocurrió un error inesperado
ru: Произошла непредвиденная ошибка
zh: 发生意外错误

source: Unexpected response format
ar: تنسيق استجابة غير متوقع
bn: অপ্রত্যাশিত রেসপন্স ফরম্যাট
de: Unerwartetes Antwortformat
es: Formato de respuesta inesperado
ru: Непредвиденный формат ответа
zh: 意外的响应格式

source: Bad request
ar: طلب غير صالح
bn: ত্রুটিপূর্ণ অনুরোধ
de: Ungültige Anfrage
es: Solicitud incorrecta
ru: Неверный запрос
zh: 错误请求

source: Unauthorized access. Please login again.
ar: دخول غير مصرح به. يرجى تسجيل الدخول مرة أخرى.
bn: অননুমোদিত প্রবেশ। দয়া করে আবার লগইন করুন।
de: Unbefugter Zugriff. Bitte erneut anmelden.
es: Acceso no autorizado. Por favor inicia sesión nuevamente.
ru: Неавторизованный доступ. Пожалуйста, войдите снова.
zh: 未授权访问。请重新登录。

source: Forbidden access. Please login again.
ar: دخول ممنوع. يرجى تسجيل الدخول مرة أخرى.
bn: নিষিদ্ধ প্রবেশ। দয়া করে আবার লগইন করুন।
de: Zugriff verboten. Bitte erneut anmelden.
es: Acceso prohibido. Por favor inicia sesión nuevamente.
ru: Доступ запрещён. Пожалуйста, войдите снова.
zh: 禁止访问。请重新登录。

source: Validation error
ar: خطأ في التحقق من البيانات
bn: ভ্যালিডেশন ত্রুটি
de: Validierungsfehler
es: Error de validación
ru: Ошибка валидации
zh: 验证错误

source: Internal server error
ar: خطأ في الخادم الداخلي
bn: সার্ভার অভ্যন্তরীণ ত্রুটি
de: Interner Serverfehler
es: Error interno del servidor
ru: Внутренняя ошибка сервера
zh: 服务器内部错误

source: Something went wrong
ar: حدث خطأ ما
bn: কিছু ভুল হয়েছে
de: Etwas ist schiefgelaufen
es: Algo salió mal
ru: Что-то пошло не так
zh: 出现错误

source: No internet connection.
ar: لا يوجد اتصال بالإنترنت.
bn: ইন্টারনেট সংযোগ নেই।
de: Keine Internetverbindung.
es: Sin conexión a Internet.
ru: Отсутствует интернет-соединение.
zh: 无网络连接。

source: Request timed out. Please try again.
ar: انتهت مهلة الطلب. يرجى المحاولة مرة أخرى.
bn: অনুরোধের সময় শেষ হয়েছে। অনুগ্রহ করে আবার চেষ্টা করুন।
de: Zeitüberschreitung der Anfrage. Bitte versuchen Sie es erneut.
es: La solicitud expiró. Por favor intenta de nuevo.
ru: Время запроса истекло. Пожалуйста, попробуйте снова.
zh: 请求超时。请再试一次。

# something_went_wrong_exclamation
source: Something went wrong!
ar: حدث خطأ ما!
bn: কিছু ভুল হয়েছে!
de: Etwas ist schiefgelaufen!
es: ¡Algo salió mal!
ru: Что-то пошло не так!
zh: 出了点问题！

source: Resource not found.
ar: المورد غير موجود.
bn: সম্পদ পাওয়া যায়নি।
de: Ressource nicht gefunden.
es: Recurso no encontrado.
ru: Ресурс не найден.
zh: 资源未找到。

source: Unexpected Application Crash
ar: تعطل التطبيق بشكل غير متوقع
bn: অপ্রত্যাশিত অ্যাপ ক্র্যাশ
de: Unerwarteter Anwendungsabsturz
es: Fallo inesperado de la aplicación
ru: Неожиданное завершение работы приложения
zh: 应用程序意外崩溃

# app_encountered_unexpected_error
source: The app encountered an unexpected error and had to close. This could be caused by insufficient device memory, a bug in the app, or a corrupted file. Please restart the app or reinstall it if the issue continues.
ar: واجه التطبيق خطأً غير متوقع واضطر إلى الإغلاق. قد يكون السبب ذاكرة جهاز غير كافية، خطأ في التطبيق، أو ملف تالف. يرجى إعادة تشغيل التطبيق أو إعادة تثبيته إذا استمرت المشكلة.
bn: অ্যাপটি একটি অপ্রত্যাশিত ত্রুটির সম্মুখীন হয়েছে এবং বন্ধ করতে হয়েছে। এটি হতে পারে ডিভাইসের মেমোরি কম থাকা, অ্যাপের বাগ, বা ক্ষতিগ্রস্ত ফাইলের কারণে। সমস্যা চলতে থাকলে অ্যাপটি রিস্টার্ট করুন অথবা পুনরায় ইনস্টল করুন।
de: Die App hat einen unerwarteten Fehler festgestellt und musste geschlossen werden. Dies kann durch unzureichenden Gerätespeicher, einen Fehler in der App oder eine beschädigte Datei verursacht werden. Bitte starten Sie die App neu oder installieren Sie sie erneut, falls das Problem weiterhin besteht.
es: La aplicación encontró un error inesperado y tuvo que cerrarse. Esto podría deberse a memoria insuficiente del dispositivo, un error en la aplicación o un archivo dañado. Por favor, reinicie la aplicación o vuelva a instalarla si el problema continúa.
ru: Приложение столкнулось с неожиданной ошибкой и было закрыто. Это могло произойти из-за недостаточной памяти устройства, ошибки в приложении или повреждённого файла. Пожалуйста, перезапустите приложение или переустановите его, если проблема продолжится.
zh: 应用程序遇到意外错误并被迫关闭。这可能是由于设备内存不足、应用程序中的错误或文件损坏引起的。如果问题持续，请重启应用或重新安装。

source: Contact Support
ar: اتصل بالدعم
bn: সাপোর্টের সাথে যোগাযোগ করুন
de: Support kontaktieren
es: Contactar Soporte
ru: Связаться с поддержкой
zh: 联系支持

source: Theme
ar: المظهر
bn: থিম
de: Thema
es: Tema
ru: Тема
zh: 主题

source: Select Profile Image
ar: اختر صورة الملف الشخصي
bn: প্রোফাইল ছবি নির্বাচন করুন
de: Profilbild auswählen
es: Seleccionar imagen de perfil
ru: Выберите изображение профиля
zh: 选择个人头像

source: Upload image
ar: رفع الصورة
bn: ছবি আপলোড করুন
de: Bild hochladen
es: Subir imagen
ru: Загрузить изображение
zh: 上传图片

# or_select_avatar
source: Or select an avatar from the list below:
ar: أو اختر صورة رمزية من القائمة أدناه:
bn: অথবা নিচের তালিকা থেকে একটি অবতার নির্বাচন করুন:
de: Oder wählen Sie einen Avatar aus der Liste unten:
es: O seleccione un avatar de la lista a continuación:
ru: Или выберите аватар из списка ниже:
zh: 或从下面的列表中选择一个头像：

source: Report Issue
ar: الإبلاغ عن مشكلة
bn: সমস্যা জানান
de: Problem melden
es: Reportar un problema
ru: Сообщить о проблеме
zh: 报告问题

source: Ride Details
ar: تفاصيل الرحلة
bn: যাত্রার বিস্তারিত
de: Fahrtdetails
es: Detalles del viaje
ru: Детали поездки
zh: 行程详情

# textCopied
source: Text been copied
ar: تم نسخ النص
bn: টেক্সট কপি হয়েছে
de: Text kopiert
es: Texto copiado
ru: Текст скопирован
zh: 文本已复制

# reportIssueTitle
source: Something Went Wrong? Report an Issue
ar: هل حدث خطأ ما؟ أبلغ عن مشكلة
bn: কোনো সমস্যা হয়েছে? সমস্যা রিপোর্ট করুন
de: Etwas ist schiefgelaufen? Melden Sie ein Problem
es: ¿Algo salió mal? Reporta un problema
ru: Что-то пошло не так? Сообщите о проблеме
zh: 出现问题了吗？报告一个问题

# reportIssueSubtitle
source: Tell us what went wrong. We’ll look into it immediately.
ar: أخبرنا بما حدث. سنتحقق على الفور.
bn: আমাদের জানান কী হয়েছে। আমরা দ্রুত সমাধান করব।
de: Teilen Sie uns mit, was passiert ist. Wir kümmern uns sofort darum.
es: Cuéntanos qué ocurrió. Lo revisaremos de inmediato.
ru: Расскажите нам, что пошло не так. Мы сразу же разберёмся.
zh: 告诉我们发生了什么。我们会立即处理。

source: Report Type
ar: نوع التقرير
bn: রিপোর্টের ধরন
de: Berichtstyp
es: Tipo de reporte
ru: Тип отчёта
zh: 报告类型

source: Select Report type
ar: اختر نوع التقرير
bn: রিপোর্টের ধরন নির্বাচন করুন
de: Berichtstyp auswählen
es: Selecciona el tipo de reporte
ru: Выберите тип отчёта
zh: 选择报告类型

source: Details
ar: تفاصيل
bn: বিস্তারিত
es: Detalles
ru: Детали
zh: 详情

source: Write Issue Details
ar: اكتب تفاصيل المشكلة
bn: সমস্যার বিস্তারিত লিখুন
de: Problemdetails eingeben
es: Escribe los detalles del problema
ru: Опишите проблему
zh: 填写问题详情

# insertAllData
source: Please insert all Data
ar: الرجاء إدخال جميع البيانات
bn: অনুগ্রহ করে সব তথ্য প্রদান করুন
de: Bitte alle Daten eingeben
es: Por favor ingrese todos los datos
ru: Пожалуйста, введите все данные
zh: 请输入所有数据

# issueSubmitted
source: Your Issue Submitted Successfully
ar: تم إرسال المشكلة بنجاح
bn: আপনার সমস্যা সফলভাবে জমা হয়েছে
de: Ihr Problem wurde erfolgreich eingereicht
es: Tu problema se envió con éxito
ru: Ваша проблема успешно отправлена
zh: 您的问题已成功提交

# thanksForReporting
source: Thanks for reporting. Our team will review your issue and get back to you shortly.
ar: شكرًا على إبلاغنا. سيتولى فريقنا مراجعة مشكلتك والتواصل معك قريبًا.
bn: সমস্যা জানানোর জন্য ধন্যবাদ। আমাদের টিম দ্রুত আপনার সাথে যোগাযোগ করবে।
de: Vielen Dank für Ihre Meldung. Unser Team wird Ihr Problem prüfen und sich bald mit Ihnen in Verbindung setzen.
es: Gracias por reportar. Nuestro equipo revisará tu problema y se pondrá en contacto contigo pronto.
ru: Спасибо за сообщение. Наша команда рассмотрит вашу проблему и свяжется с вами в ближайшее время.
zh: 感谢您的反馈。我们的团队会尽快查看您的问题并与您联系。

source: Download Receipt
ar: تنزيل الإيصال
bn: রসিদ ডাউনলোড করুন
de: Beleg herunterladen
es: Descargar recibo
ru: Скачать квитанцию
zh: 下载收据

source: Status
ar: الحالة
bn: অবস্থা
es: Estado
ru: Статус
zh: 状态

source: Payment Method
ar: طريقة الدفع
bn: পেমেন্ট পদ্ধতি
de: Zahlungsmethode
es: Método de pago
ru: Способ оплаты
zh: 支付方式

source: Ride Charge
ar: أجرة الرحلة
bn: যাত্রার চার্জ
de: Fahrpreis
es: Tarifa del viaje
ru: Стоимость поездки
zh: 车费

source: Request Entity Too Large
ar: الكيان المطلوب كبير جدًا
bn: অনুরোধকৃত এককটি খুব বড়
de: Anforderungsentität zu groß
es: Entidad de solicitud demasiado grande
ru: Слишком большой объект запроса
zh: 请求实体过大

source: Login
ar: تسجيل الدخول
bn: লগইন
de: Anmelden
es: Iniciar sesión
ru: Войти
zh: 登录

# yourAccountAlreadyActive
source: Your account is already active on another device. To use it here, the other device will be logged out.
ar: حسابك نشط بالفعل على جهاز آخر. لاستخدامه هنا، سيتم تسجيل خروج الجهاز الآخر.
bn: আপনার অ্যাকাউন্ট ইতিমধ্যেই অন্য ডিভাইসে সক্রিয় আছে। এখানে ব্যবহার করতে চাইলে অন্য ডিভাইস থেকে লগআউট হয়ে যাবে।
de: Ihr Konto ist bereits auf einem anderen Gerät aktiv. Um es hier zu verwenden, wird das andere Gerät abgemeldet.
es: Su cuenta ya está activa en otro dispositivo. Para usarla aquí, se cerrará la sesión en el otro dispositivo.
ru: Ваша учетная запись уже активна на другом устройстве. Чтобы использовать её здесь, с другого устройства будет выполнен выход.
zh: 您的账户已在另一台设备上登录。要在此使用，它将在另一台设备上退出登录。

source: Logging in Somewhere Else
ar: تسجيل الدخول من مكان آخر
bn: অন্য কোথাও লগইন করা হচ্ছে
de: Anmeldung auf einem anderen Gerät
es: Iniciando sesión en otro lugar
ru: Вход с другого устройства
zh: 正在其他设备登录

source: Stay on This Device
ar: البقاء على هذا الجهاز
bn: এই ডিভাইসে থাকুন
de: Auf diesem Gerät bleiben
es: Permanecer en este dispositivo
ru: Остаться на этом устройстве
zh: 留在此设备上

source: View Details
ar: عرض التفاصيل
bn: বিস্তারিত দেখুন
de: Details anzeigen
es: Ver detalles
ru: Посмотреть детали
zh: 查看详情
