Repository: MGanesh517/Gauva-Rider
Catalog: lib/l10n/intl_*.arb
Languages: ar, bn, de, es, ru, zh

source: Skip
ar: تخطي
bn: এড়িয়ে যান
de: Überspringen
es: Saltar
ru: Пропустить
zh: 跳过

# welcomeTitle
source: Welcome to Ready Ride
ar: مرحبا بكم فيReady Ride ً
bn: Ready Ride এ স্বাগতম
de: Willkommen bei Ready Ride
es: Bienvenido a Ready Ride
ru: Добро пожаловать в Ready Ride
zh: 欢迎使用 Ready Ride

# rideYourWay
source: Your Ride, Your Way
ar: رحلتك، بطريقتك
bn: আপনার যাত্রা, আপনার মতো
de: Deine Fahrt, dein Weg
es: Tu viaje, a tu manera
ru: Ваша поездка — по вашему выбору
zh: 您的出行，由您掌控

# safetyPriority
source: Your Safety, Our Priority
ar: سلامتك، أولويتنا
bn: আপনার নিরাপত্তা, আমাদের অগ্রাধিকার
de: Deine Sicherheit, unsere Priorität
es: Tu seguridad, nuestra prioridad
ru: Ваша безопасность — наш приоритет
zh: 您的安全，我们的首要任务

# smartRideSavings
source: Smart Rides, Smart Savings.
ar: رحلات ذكية، توفير ذكي.
bn: স্মার্ট রাইড, স্মার্ট সাশ্রয়।
de: Smarte Fahrten, smarte Ersparnisse.
es: Viajes inteligentes, ahorros inteligentes.
ru: Умные поездки, умные сбережения.
zh: 智能出行，聪明省钱。

# welcomeSubtitle
source: Effortless rides at your fingertips. Experience fast, reliable, and safe transportation anytime, anywhere.
ar: رحلات سهلة في متناول يدك. استمتع بالنقل السريع والموثوق والآمن في أي وقت وفي أي مكان.
bn: আপনার আঙুলের ছোঁয়ায় সহজ রাইড। যেকোনো সময়, যেকোনো জায়গায় দ্রুত, নির্ভরযোগ্য এবং নিরাপদ যাত্রার অভিজ্ঞতা নিন।
de: Mühelose Fahrten auf Knopfdruck. Erleben Sie jederzeit und überall schnelle, zuverlässige und sichere Transportmittel.
es: Viajes sin esfuerzo al alcance de tu mano. Experimenta un transporte rápido, confiable y seguro en cualquier momento y lugar.
ru: Лёгкие поездки под рукой. Быстрый, надежный и безопасный транспорт в любое время и в любом месте.
zh: 轻松出行触手可及。随时随地体验快速、可靠和安全的交通服务。

source: Let's Go
ar: لنذهب
bn: চলুন শুরু করি
de: Los geht's
es: Vamos
ru: Поехали
zh: 出发吧

source: Proceed Next
ar: المتابعة التالية
bn: পরবর্তী ধাপে যান
de: Weiter
es: Proceder al siguiente
ru: Далее
zh: 继续下一步

source: Get Started
ar: ابدأ
bn: শুরু করুন
de: Loslegen
es: Empezar
ru: Начать
zh: 开始使用

# safeSecure
source: Safe & Secure Rides
ar: رحلات آمنة ومضمونة
bn: নিরাপদ ও সুরক্ষিত রাইড
de: Sichere und geschützte Fahrten
es: Viajes seguros y protegidos
ru: Безопасные и надёжные поездки
zh: 安全可靠的出行

# rideFeatures
source: Real-time tracking, verified drivers, and secure payments ensure a worry-free ride experience.
ar: تتبع فوري، سائقون موثقون، ومدفوعات آمنة تضمن تجربة ركوب بدون قلق.
bn: রিয়েল-টাইম ট্র্যাকিং, যাচাইকৃত ড্রাইভার এবং নিরাপদ পেমেন্ট নিশ্চিত করে নিশ্চিন্ত রাইড অভিজ্ঞতা।
de: Echtzeitverfolgung, verifizierte Fahrer und sichere Zahlungen sorgen für eine sorgenfreie Fahrt.
es: Seguimiento en tiempo real, conductores verificados y pagos seguros garantizan una experiencia sin preocupaciones.
ru: Отслеживание в реальном времени, проверенные водители и безопасные платежи обеспечивают спокойную поездку.
zh: 实时追踪、认证司机和安全支付，确保您无忧出行。

source: Affordable & Convenient
ar: مريحة وبأسعار معقولة
bn: সাশ্রয়ী ও সুবিধাজনক
de: Erschwinglich & bequem
es: Asequible y conveniente
ru: Доступно и удобно
zh: 实惠又方便

# rideBookingEase
source: Enjoy competitive fares, multiple ride options, and seamless booking with just a tap.
ar: استمتع بأسعار تنافسية، خيارات ركوب متعددة، وحجز سلس بنقرة واحدة فقط.
bn: প্রতিযোগিতামূলক ভাড়া, একাধিক রাইড অপশন এবং শুধু একটি ট্যাপে নির্বিঘ্ন বুকিং উপভোগ করুন।
de: Genießen Sie wettbewerbsfähige Preise, mehrere Fahrmöglichkeiten und eine nahtlose Buchung mit nur einem Fingertipp.
es: Disfruta de tarifas competitivas, múltiples opciones de viaje y una reserva perfecta con solo un toque.
ru: Наслаждайтесь выгодными тарифами, разными вариантами поездок и удобным бронированием в одно касание.
zh: 享受优惠价格、多种乘车选择和一键式轻松预订。

# helloText
source: Hello...
ar: مرحباً...
bn: হ্যালো...
de: Hallo...
es: Hola...
ru: Здравствуйте...
zh: 你好...

source: Welcome Back!
ar: مرحبًا بعودتك!
bn: ফিরে আসার জন্য স্বাগতম!
de: Willkommen zurück!
es: ¡Bienvenido de nuevo!
ru: С возвращением!
zh: 欢迎回来！

# enterPhoneDes
source: Enter your phone number to continue your ride and stay updated.
ar: أدخل رقم هاتفك لمتابعة رحلتك والبقاء على اطلاع.
bn: আপনার রাইড চালিয়ে যেতে এবং আপডেট থাকতে আপনার ফোন নম্বর লিখুন।
de: Gib deine Telefonnummer ein, um weiterzufahren und auf dem Laufenden zu bleiben.
es: Ingresa tu número de teléfono para continuar tu viaje y mantenerte informado.
ru: Введите номер телефона, чтобы продолжить поездку и оставаться в курсе.
zh: 请输入您的电话号码以继续出行并保持更新。

source: Phone No
ar: رقم الهاتف
bn: ফোন নম্বর
de: Telefonnummer
es: Número de teléfono
ru: Телефон
zh: 电话号码

source: Log in / Sign up
ar: تسجيل الدخول / إنشاء حساب
bn: লগইন / সাইন আপ
de: Einloggen / Registrieren
es: Iniciar sesión / Registrarse
zh: 登录 / 注册

source: Enter phone number
ar: أدخل رقم الهاتف
bn: ফোন নম্বর লিখুন
de: Telefonnummer eingeben
es: Ingrese el número de teléfono
ru: Введите номер телефона
zh: 请输入电话号码

# phoneMinLengthError
source: Phone number must be at least 6 digits
ar: يجب أن يحتوي رقم الهاتف على 6 أرقام على الأقل
bn: ফোন নম্বরে অন্তত ৬টি সংখ্যা থাকতে হবে
de: Die Telefonnummer muss mindestens 6 Ziffern enthalten
es: El número de teléfono debe tener al menos 6 dígitos
ru: Номер телефона должен содержать не менее 6 цифр
zh: 电话号码至少应包含6位数字

# otp_enter_title
source: Enter Your OTP
ar: أدخل رمز التحقق
bn: আপনার ওটিপি লিখুন
de: Geben Sie Ihr OTP ein
es: Introduce tu OTP
ru: Введите ваш OTP
zh: 输入您的验证码

# otp_sent_message
source: We sent OTP code to your phone number
ar: لقد أرسلنا رمز التحقق إلى رقم هاتفك
bn: আমরা আপনার ফোন নম্বরে একটি ওটিপি পাঠিয়েছি
de: Wir haben einen OTP-Code an Ihre Telefonnummer gesendet
es: Hemos enviado un código OTP a tu número de teléfono
ru: Мы отправили код OTP на ваш номер телефона
zh: 我们已将验证码发送到您的手机号码

# otp_input_hint
source: Write Your OTP
ar: اكتب رمز التحقق
bn: ওটিপি লিখুন
de: Geben Sie Ihr OTP ein
es: Escribe tu OTP
ru: Введите OTP
zh: 输入验证码

# otp_resend
source: Resend
ar: إعادة الإرسال
bn: পুনরায় পাঠান
de: Erneut senden
es: Reenviar
ru: Отправить снова
zh: 重新发送

# otp_resend_timer
source: Resend code in 00:{secondsRemaining}
ar: أعد إرسال الرمز خلال 00${secondsRemaining}
bn: 00:{secondsRemaining} সেকেন্ডে কোড পুনরায় পাঠান
de: Code erneut senden in 00:{secondsRemaining}
es: Reenviar código en 00:{secondsRemaining}
ru: Отправить код повторно через 00:{secondsRemaining}
zh: 00:{secondsRemaining} 后重新发送验证码

# otp_save_button
source: Save
ar: حفظ
bn: সংরক্ষণ করুন
de: Speichern
es: Guardar
ru: Сохранить
zh: 保存

# otp_title_short
source: OTP
ar: رمز التحقق
bn: ওটিপি
zh: 验证码

# password_label
source: Password
ar: كلمة المرور
bn: পাসওয়ার্ড
de: Passwort
es: Contraseña
ru: Пароль
zh: 密码

# password_hint
source: Set a Strong Password
ar: قم بتعيين كلمة مرور قوية
bn: একটি শক্তিশালী পাসওয়ার্ড সেট করুন
de: Legen Sie ein sicheres Passwort fest
es: Establece una contraseña segura
ru: Установите надёжный пароль
zh: 设置一个强密码

# password_requirements
source: Use at least {length} characters
ar: استخدم ما لا يقل عن {length} أحرف
bn: {length} অক্ষরের একটি পাসওয়ার্ড ব্যবহার করুন।
de: Verwenden Sie mindestens {length} Zeichen
es: Utilice al menos {length} caracteres
ru: Используйте не менее {length} символов
zh: 至少使用 {length} 个字符

source: Confirm Password
ar: تأكيد كلمة المرور
bn: পাসওয়ার্ড নিশ্চিত করুন
de: Passwort bestätigen
es: Confirmar contraseña
ru: Подтвердите пароль
zh: 确认密码

# password_mismatch
source: Passwords do not match.
ar: كلمتا المرور غير متطابقتين.
bn: পাসওয়ার্ড মিলছে না।
de: Passwörter stimmen nicht überein.
es: Las contraseñas no coinciden.
ru: Пароли не совпадают.
zh: 密码不匹配。

# field_required
source: This field is required
ar: هذه الخانة مطلوبه
bn: এই ঘরটি অবশ্যই পূরণ করতে হবে
de: Dieses Feld ist erforderlich
es: Este campo es obligatorio
ru: Это поле обязательно для заполнения
zh: 此字段是必填项

# min_length_error
source: Must be at least {length} characters
ar: يجب أن تحتوي على {length} حرفًا على الأقل
bn: অন্তত {length} অক্ষরের হতে হবে
de: Muss mindestens {length} Zeichen enthalten
es: Debe tener al menos {length} caracteres
ru: Должно быть не менее {length} символов
zh: 必须至少为 {length} 个字符

# profile_info_title
source: Profile Info
ar: معلومات الملف الشخصي
bn: প্রোফাইল তথ্য
de: Profilinformationen
es: Información del perfil
ru: Информация профиля
zh: 个人信息

# profile_info_subtitle
source: Add Profile Info
ar: أضف معلومات الملف الشخصي
bn: প্রোফাইল তথ্য যুক্ত করুন
de: Profilinformationen hinzufügen
es: Agregar información del perfil
ru: Добавить информацию профиля
zh: 添加个人信息

# profile_info_description
source: Enter your details to complete your profile and enhance your experience.
ar: أدخل تفاصيلك لإكمال ملفك الشخصي وتحسين تجربتك.
bn: আপনার প্রোফাইল সম্পূর্ণ করতে এবং অভিজ্ঞতা উন্নত করতে আপনার তথ্য লিখুন।
de: Geben Sie Ihre Daten ein, um Ihr Profil zu vervollständigen und Ihre Erfahrung zu verbessern.
es: Ingresa tus datos para completar tu perfil y mejorar tu experiencia.
ru: Введите свои данные, чтобы завершить профиль и улучшить взаимодействие.
zh: 输入您的详细信息以完成个人资料并提升体验。

# name_label
source: Name
ar: الاسم
bn: নাম
es: Nombre
ru: Имя
zh: 姓名

# email_label
source: Email
ar: البريد الإلكتروني
bn: ইমেইল
es: Correo electrónico
ru: Эл. почта
zh: 电子邮件

# gender_label
source: Gender
ar: الجنس
bn: লিঙ্গ
de: Geschlecht
es: Género
ru: Пол
zh: 性别

# gender_male
source: Male
ar: ذكر
bn: পুরুষ
de: Männlich
es: Masculino
ru: Мужской
zh: 男

# gender_female
source: Female
ar: أنثى
bn: নারী
de: Weiblich
es: Femenino
ru: Женский
zh: 女

# gender_other
source: Other
ar: آخر
bn: অন্যান্য
de: Andere
es: Otro
ru: Другой
zh: 其他

# gender_select
source: Select Gender
ar: اختر الجنس
bn: লিঙ্গ নির্বাচন করুন
de: Geschlecht auswählen
es: Seleccionar género
ru: Выберите пол
zh: 选择性别

source: Fetching address...
ar: جارٍ جلب العنوان...
bn: ঠিকানা আনা হচ্ছে...
de: Adresse wird abgerufen...
es: Obteniendo dirección...
ru: Получение адреса...
zh: 正在获取地址...

source: Search Destination
ar: ابحث عن الوجهة
bn: গন্তব্য অনুসন্ধান
de: Ziel suchen
es: Buscar destino
ru: Поиск места назначения
zh: 搜索目的地

source: Services
ar: الخدمات
bn: সেবা
de: Dienstleistungen
es: Servicios
ru: Услуги
zh: 服务

source: Please wait...
ar: الرجاء الانتظار...
bn: অনুগ্রহ করে অপেক্ষা করুন...
de: Bitte warten...
es: Por favor espera...
ru: Пожалуйста, подождите...
zh: 请稍候...

source: Home
ar: الرئيسية
bn: হোম
de: Startseite
es: Inicio
ru: Главная
zh: 首页

source: Wallet
ar: المحفظة
bn: ওয়ালেট
de: Brieftasche
es: Billetera
ru: Кошелек
zh: 钱包

source: Activity
ar: النشاط
bn: কার্যক্রম
de: Aktivität
es: Actividad
ru: Активность
zh: 活动

source: Account
ar: الحساب
bn: অ্যাকাউন্ট
de: Konto
es: Cuenta
ru: Аккаунт
zh: 账户

source: No wallet data available
ar: لا توجد بيانات محفظة
bn: কোনও ওয়ালেট তথ্য পাওয়া যায়নি
de: Keine Wallet-Daten verfügbar
es: No hay datos de la billetera disponibles
ru: Нет данных кошелька
zh: 没有钱包数据

source: Wallet Balance
ar: رصيد المحفظة
bn: ওয়ালেট ব্যালেন্স
de: Wallet-Guthaben
es: Saldo de la billetera
ru: Баланс кошелька
zh: 钱包余额

source: Payment Gateway
ar: بوابة الدفع
bn: পেমেন্ট গেটওয়ে
de: Zahlungsgateway
es: Pasarela de pago
ru: Платёжный шлюз
zh: 支付网关

source: Add New
ar: إضافة جديد
bn: নতুন যোগ করুন
de: Neu hinzufügen
es: Agregar nuevo
ru: Добавить новый
zh: 新增

source: No Cards yet!
ar: لا توجد بطاقات بعد!
bn: এখনও কোনও কার্ড নেই!
de: Noch keine Karten!
es: ¡Aún no hay tarjetas!
ru: Пока нет карт!
zh: 还没有卡片！

source: Today
ar: اليوم
bn: আজ
de: Heute
es: Hoy
ru: Сегодня
zh: 今天

source: Complete Ride
ar: إنهاء الرحلة
bn: রাইড সম্পন্ন করুন
de: Fahrt abschließen
es: Completar viaje
ru: Завершить поездку
zh: 完成行程

source: Cancel Ride
ar: إلغاء الرحلة
bn: রাইড বাতিল করুন
de: Fahrt abbrechen
es: Cancelar viaje
ru: Отменить поездку
zh: 取消行程

source: No rides yet.
ar: لا توجد رحلات بعد.
bn: এখনও কোনও রাইড নেই।
de: Noch keine Fahrten.
es: Aún no hay viajes.
ru: Пока нет поездок.
zh: 暂无行程。

# error_with_msg
source: Error: {msg}
ar: خطأ: {msg}
bn: ত্রুটি: {msg}
de: Fehler: {msg}
ru: Ошибка: {msg}
zh: 错误：{msg}

source: My Profile
ar: ملفي الشخصي
bn: আমার প্রোফাইল
de: Mein Profil
es: Mi perfil
ru: Мой профиль
zh: 我的资料

source: Change Password
ar: تغيير كلمة المرور
bn: পাসওয়ার্ড পরিবর্তন করুন
de: Passwort ändern
es: Cambiar contraseña
ru: Сменить пароль
zh: 更改密码

source: Terms & Conditions
ar: الأحكام والشروط
bn: শর্তাবলী
de: Allgemeine Geschäftsbedingungen
es: Términos y condiciones
ru: Условия и положения
zh: 条款和条件

source: Privacy Policy
ar: سياسة الخصوصية
bn: প্রাইভেসি পলিসি
de: Datenschutzrichtlinie
es: Política de privacidad
ru: Политика конфиденциальности
zh: 隐私政策

source: Log Out
ar: تسجيل الخروج
bn: লগ আউট
de: Abmelden
es: Cerrar sesión
ru: Выйти
zh: 退出登录

source: Delete Account
ar: حذف الحساب
bn: অ্যাকাউন্ট মুছে ফেলুন
de: Konto löschen
es: Eliminar cuenta
ru: Удалить аккаунт
zh: 删除账户

source: Language
ar: اللغة
bn: ভাষা
de: Sprache
es: Idioma
ru: Язык
zh: 语言

# are_you_sure_msg
source: Are You Sure You Want to {msg} from App
ar: هل أنت متأكد أنك تريد {msg} من التطبيق؟
bn: আপনি কি নিশ্চিত আপনি অ্যাপ থেকে {msg} করতে চান?
de: Sind Sie sicher, dass Sie {msg} aus der App möchten?
es: ¿Estás seguro de que quieres {msg} de la aplicación?
ru: Вы уверены, что хотите {msg} из приложения?
zh: 您确定要从应用中{msg}吗？

# see_you_next_ride
source: We hope to see you again soon for your next ride!
ar: نأمل أن نراك مرة أخرى في رحلتك القادمة!
bn: পরবর্তী রাইডের জন্য আবার আপনাকে দেখতে চাই!
de: Wir hoffen, Sie bald wieder für Ihre nächste Fahrt zu sehen!
es: ¡Esperamos verte pronto en tu próximo viaje!
ru: Надеемся увидеть вас снова в следующей поездке!
zh: 期待您下次再来搭乘！

source: Exit
ar: خروج
bn: প্রস্থান
de: Beenden
es: Salir
ru: Выход
zh: 退出

source: Cancel
ar: إلغاء
bn: বাতিল করুন
de: Abbrechen
es: Cancelar
ru: Отмена
zh: 取消

source: Location Permission Needed
ar: مطلوب إذن الموقع
bn: লোকেশন অনুমতি প্রয়োজন
de: Standortberechtigung erforderlich
es: Permiso de ubicación necesario
ru: Требуется доступ к геолокации
zh: 需要位置权限

# location_permission_msg
source: Please enable location access to use this feature.
ar: يرجى تمكين الوصول إلى الموقع لاستخدام هذه الميزة.
bn: এই ফিচারটি ব্যবহারের জন্য লোকেশন অ্যাক্সেস চালু করুন।
de: Bitte aktivieren Sie den Standortzugriff, um diese Funktion zu nutzen.
es: Por favor, habilita el acceso a la ubicación para usar esta función.
ru: Пожалуйста, включите доступ к местоположению для использования этой функции.
zh: 请启用位置访问权限以使用此功能。

source: Grant Permission
ar: منح الإذن
bn: অনুমতি দিন
de: Berechtigung erteilen
es: Conceder permiso
ru: Предоставить доступ
zh: 授予权限

# find_you_faster
source: Let’s Find You Faster!
ar: دعنا نساعدك في العثور بسرعة!
bn: চলুন আপনাকে দ্রুত খুঁজে নেই!
de: Lassen Sie uns Sie schneller finden!
es: ¡Vamos a encontrarte más rápido!
ru: Давайте найдем вас быстрее!
zh: 让我们更快找到你！

# find_you_faster_msg
source: Enable location access to get matched with nearby drivers quickly and easily.
ar: قم بتمكين الموقع للعثور على السائقين القريبين بسهولة وسرعة.
bn: লোকেশন চালু করুন যাতে কাছাকাছি ড্রাইভারের সাথে সহজে ম্যাচ করা যায়।
de: Standortzugriff aktivieren, um schnell Fahrer in der Nähe zu finden.
es: Activa la ubicación para conectarte con conductores cercanos fácilmente.
ru: Включите доступ к геолокации, чтобы быстро найти ближайших водителей.
zh: 启用位置访问以快速匹配附近的司机。

source: Skip for Now
ar: تخطي الآن
bn: এখনই বাদ দিন
de: Jetzt überspringen
es: Saltar por ahora
ru: Пропустить сейчас
zh: 暂时跳过

source: Allow
ar: السماح
bn: অনুমতি দিন
de: Zulassen
es: Permitir
ru: Разрешить
zh: 允许

source: Select Pickup location
ar: اختر موقع الالتقاط
bn: পিকআপ লোকেশন নির্বাচন করুন
de: Abholort auswählen
es: Seleccionar lugar de recogida
ru: Выберите место посадки
zh: 选择上车地点

source: Confirm
ar: تأكيد
bn: নিশ্চিত করুন
de: Bestätigen
es: Confirmar
ru: Подтвердить
zh: 确认

source: Pick-up
ar: نقطة الالتقاط
bn: পিকআপ
de: Abholung
es: Recogida
ru: Место посадки
zh: 上车点

source: Stop point
ar: نقطة التوقف
bn: স্টপ পয়েন্ট
de: Zwischenstopp
es: Punto de parada
ru: Промежуточная точка
zh: 中途站点

source: Destination
ar: الوجهة
bn: গন্তব্য
de: Zielort
es: Destino
ru: Пункт назначения
zh: 目的地

source: Enter pick-up point
ar: أدخل نقطة الالتقاط
bn: পিকআপ পয়েন্ট লিখুন
de: Abholort eingeben
es: Ingrese punto de recogida
ru: Введите место посадки
zh: 请输入上车点

source: Enter stop point
ar: أدخل نقطة التوقف
bn: স্টপ পয়েন্ট লিখুন
de: Zwischenstopp eingeben
es: Ingrese punto de parada
ru: Введите точку остановки
zh: 请输入中途站点

source: Enter destination
ar: أدخل الوجهة
bn: গন্তব্য লিখুন
de: Zielort eingeben
es: Ingrese destino
ru: Введите пункт назначения
zh: 请输入目的地

# choose_ride_title
source: Choose a Ride That Suits You
ar: اختر الرحلة التي تناسبك
bn: আপনার জন্য উপযুক্ত রাইডটি বেছে নিন
de: Wählen Sie eine passende Fahrt
es: Elige un viaje que se adapte a ti
ru: Выберите подходящую поездку
zh: 选择适合您的行程

source: Ride Preferences
ar: تفضيلات الرحلة
bn: রাইড পছন্দ
de: Fahrtpräferenzen
es: Preferencias de viaje
ru: Настройки поездки
zh: 行程偏好

source: No Service Available
ar: لا توجد خدمة متاحة
bn: কোনো পরিষেবা পাওয়া যায়নি
de: Kein Service verfügbar
es: No hay servicio disponible
ru: Сервис недоступен
zh: 暂无服务

source: Apply
ar: تطبيق
bn: প্রয়োগ করুন
de: Anwenden
es: Aplicar
ru: Применить
zh: 应用

# ride_preferences_description
source: Select the type of ride that best suits your needs.
ar: اختر نوع الرحلة التي تناسب احتياجاتك.
bn: আপনার প্রয়োজন অনুযায়ী রাইডের ধরন বেছে নিন।
de: Wählen Sie den Fahrttyp, der am besten zu Ihren Bedürfnissen passt.
es: Selecciona el tipo de viaje que mejor se adapte a tus necesidades.
ru: Выберите тип поездки, который вам подходит.
zh: 请选择最适合您需求的行程类型。

source: Initializing...
ar: جارٍ التهيئة...
bn: আরম্ভ হচ্ছে...
de: Initialisierung...
es: Inicializando...
ru: Инициализация...
zh: 初始化中...

# select_service
source: Select a Service!
ar: اختر خدمة!
bn: একটি পরিষেবা নির্বাচন করুন!
de: Service auswählen!
es: ¡Selecciona un servicio!
ru: Выберите услугу!
zh: 请选择服务！

source: Start Ride
ar: ابدأ الرحلة
bn: রাইড শুরু করুন
de: Fahrt starten
es: Iniciar viaje
ru: Начать поездку
zh: 开始行程

source: Add Coupon Code
ar: أضف رمز القسيمة
bn: কুপন কোড যোগ করুন
de: Gutscheincode hinzufügen
es: Agregar código de cupón
ru: Добавить промокод
zh: 添加优惠码

# coupon_description
source: Enter a valid coupon code to apply discounts to your ride.
ar: أدخل رمز قسيمة صالح للحصول على خصم على رحلتك.
bn: আপনার রাইডে ছাড় পেতে একটি বৈধ কুপন কোড দিন।
de: Geben Sie einen gültigen Gutscheincode ein, um Rabatte auf Ihre Fahrt zu erhalten.
es: Ingresa un código de cupón válido para aplicar descuentos a tu viaje.
ru: Введите действительный промокод для получения скидки на поездку.
zh: 请输入有效的优惠码以获取行程折扣。

source: Enter Coupon Code
ar: أدخل رمز القسيمة
bn: কুপন কোড লিখুন
de: Gutscheincode eingeben
es: Ingresa el código de cupón
ru: Введите промокод
zh: 输入优惠码

source: Ride requested
ar: تم طلب الرحلة
bn: রাইড অনুরোধ করা হয়েছে
de: Fahrt angefordert
es: Viaje solicitado
ru: Поездка запрошена
zh: 行程已请求

# searching_for_driver
source: Searching for an online driver..
ar: جارٍ البحث عن سائق متصل..
bn: অনলাইনে ড্রাইভার খোঁজা হচ্ছে..
de: Suche nach einem verfügbaren Fahrer..
es: Buscando un conductor en línea..
ru: Поиск доступного водителя..
zh: 正在搜索在线司机..

# wait_message
source: Please wait while we connect you with the nearest available driver.
ar: يرجى الانتظار حتى نقوم بتوصيلك بأقرب سائق متاح.
bn: অনুগ্রহ করে অপেক্ষা করুন যতক্ষণ না আমরা আপনাকে নিকটতম উপলব্ধ ড্রাইভারের সাথে সংযুক্ত করব।
de: Bitte warten Sie, während wir Sie mit dem nächstgelegenen verfügbaren Fahrer verbinden.
es: Espere mientras lo conectamos con el conductor disponible más cercano.
ru: Пожалуйста, подождите, пока мы соединим вас с ближайшим доступным водителем.
zh: 我们正在为您联系最近的可用司机，请稍候。

source: Type a message
ar: اكتب رسالة
bn: একটি বার্তা লিখুন
de: Nachricht eingeben
es: Escribe un mensaje
ru: Введите сообщение
zh: 输入消息

# cancel_title
source: Tell Us Why You're Cancelling The Ride
ar: أخبرنا لماذا تقوم بإلغاء الرحلة
bn: আপনি রাইড বাতিল করছেন কেন জানান
de: Sagen Sie uns, warum Sie die Fahrt stornieren
es: Dinos por qué estás cancelando el viaje
ru: Сообщите, почему вы отменяете поездку
zh: 请告诉我们您取消行程的原因

# cancel_subtitle
source: Let us know the reason for canceling your ride.
ar: يرجى إعلامنا بسبب إلغاء رحلتك.
bn: আপনার রাইড বাতিলের কারণ জানান।
de: Teilen Sie uns den Grund für Ihre Stornierung mit.
es: Cuéntanos la razón por la que cancelaste tu viaje.
ru: Сообщите нам причину отмены поездки.
zh: 请告诉我们您取消行程的原因。

# reason_driver_late
source: Driver is taking too long.
ar: السائق يتأخر كثيراً.
bn: ড্রাইভার দেরি করছে।
de: Der Fahrer braucht zu lange.
es: El conductor está tardando demasiado.
ru: Водитель слишком долго едет.
zh: 司机花的时间太长了。

# reason_wrong_location
source: Wrong pickup location.
ar: موقع الالتقاط غير صحيح.
bn: ভুল পিকআপ লোকেশন।
de: Falscher Abholort.
es: Ubicación de recogida incorrecta.
ru: Неправильное место посадки.
zh: 接载位置错误。

# reason_mismatch_info
source: Driver/vehicle info didn't match.
ar: معلومات السائق/المركبة لا تتطابق.
bn: ড্রাইভার/গাড়ির তথ্য মিলছে না।
de: Fahrer-/Fahrzeuginformationen stimmen nicht überein.
es: La información del conductor/vehículo no coincide.
ru: Информация о водителе/транспорте не совпадает.
zh: 司机/车辆信息不匹配。

# reason_changed_mind
source: Changed my mind.
ar: غيرت رأيي.
bn: ভাবনা পরিবর্তন করেছি।
de: Ich habe es mir anders überlegt.
es: Cambié de opinión.
ru: Я передумал(а).
zh: 我改变了主意。

# reason_other
source: Other
ar: أخرى
bn: অন্যান্য
de: Andere
es: Otro
ru: Другое
zh: 其他

source: Go back to ride
ar: العودة إلى الرحلة
bn: রাইডে ফিরে যান
de: Zurück zur Fahrt
es: Volver al viaje
ru: Вернуться к поездке
zh: 返回行程

source: Cancel the ride
ar: إلغاء الرحلة
bn: রাইড বাতিল করুন
de: Fahrt stornieren
es: Cancelar el viaje
ru: Отменить поездку
zh: 取消行程

source: Trips
ar: الرحلات
bn: ট্রিপসমূহ
de: Fahrten
es: Viajes
ru: Поездки
zh: 行程

# ride_on_the_way
source: Your Ride is on the Way
ar: رحلتك في الطريق
bn: আপনার রাইড আসছে
de: Ihre Fahrt ist unterwegs
es: Tu viaje está en camino
ru: Ваша поездка в пути
zh: 您的行程正在前往中

# driver_heading_to_you
source: Your driver is heading to your location. Please be ready.
ar: سائقك في طريقه إلى موقعك. يرجى الاستعداد.
bn: ড্রাইভার আপনার লোকেশনের দিকে আসছেন। অনুগ্রহ করে প্রস্তুত থাকুন।
de: Ihr Fahrer ist auf dem Weg zu Ihnen. Bitte seien Sie bereit.
es: Tu conductor se dirige a tu ubicación. Por favor, prepárate.
ru: Ваш водитель едет к вам. Пожалуйста, будьте готовы.
zh: 您的司机正在前往您的位置，请准备好。

# ride_ready
source: Your Ride is Ready!
ar: رحلتك جاهزة!
bn: আপনার রাইড প্রস্তুত!
de: Ihre Fahrt ist bereit!
es: ¡Tu viaje está listo!
ru: Ваша поездка готова!
zh: 您的行程已准备好！

# driver_arrived
source: Your driver has arrived at the pickup location. Please head over now.
ar: وصل السائق إلى موقع الالتقاء. يرجى التوجه الآن.
bn: ড্রাইভার পিকআপ লোকেশনে পৌঁছে গেছেন। এখনই যান।
de: Ihr Fahrer ist am Abholort angekommen. Bitte gehen Sie jetzt dorthin.
es: Tu conductor ha llegado al punto de recogida. Dirígete allí ahora.
ru: Водитель прибыл на место подачи. Пожалуйста, подойдите.
zh: 您的司机已到达接送地点，请立即前往。

# inside_car
source: You are inside the car. Seat comfortably
ar: أنت داخل السيارة. اجلس بشكل مريح
bn: আপনি গাড়িতে আছেন। আরামে বসুন।
de: Sie befinden sich im Auto. Machen Sie es sich bequem.
es: Estás dentro del coche. Siéntate cómodamente.
ru: Вы находитесь в машине. Устройтесь поудобнее.
zh: 您已上车，请舒适坐好

# ride_started
source: Your Ride Has Started
ar: بدأت رحلتك
bn: আপনার রাইড শুরু হয়েছে
de: Ihre Fahrt hat begonnen
es: Tu viaje ha comenzado
ru: Поездка началась
zh: 您的行程已开始

# ride_in_progress
source: Sit back and relax. Your driver is taking you to your destination.
ar: استرخِ واستمتع. سائقك يأخذك إلى وجهتك.
bn: আরামে বসে থাকুন। ড্রাইভার আপনাকে গন্তব্যে নিয়ে যাচ্ছেন।
de: Lehnen Sie sich zurück und entspannen Sie sich. Ihr Fahrer bringt Sie zu Ihrem Ziel.
es: Relájate. Tu conductor te lleva a tu destino.
ru: Расслабьтесь. Водитель везет вас к месту назначения.
zh: 请放松，司机将带您前往目的地。
